*** Evil's Root

    Evil is love. Evil is life. All hail Evil.

    #+BEGIN_SRC emacs-lisp
      (req-package evil
        :require (undo-tree ace-jump-mode)
        :ensure evil
        :init
        (evil-mode 1)
        (dolist (mode '(mu4e-main-mode
                        mu4e-headers-mode
                        mu4e-view-mode
                        woman-mode
                        help-mode
                        cider-stacktrace-mode
                        flycheck-error-list-mode
                        epa-info-mode
                        paradox-menu-mode
                        image-mode
                        emms-browser-mode
                        special-mode))
          (add-to-list 'evil-emacs-state-modes mode))
        (add-to-list 'evil-insert-state-modes 'cider-repl-mode)
        :config
        (defun evil-global-set-noninsert-key (key cmd)
          "Bind `KEY' to `CMD' in all non-insert evil states."
          (dolist (state '(normal motion visual))
            (evil-global-set-key state key cmd)))
        ;; colemak motion bindings
        (evil-global-set-noninsert-key "e" #'evil-backward-char)
        (evil-global-set-noninsert-key "n" #'evil-forward-char)
        (evil-global-set-noninsert-key "s" #'evil-previous-line)
        (evil-global-set-noninsert-key "t" #'evil-next-line)
        (evil-global-set-noninsert-key "l" #'evil-find-char-to)
        (evil-global-set-noninsert-key "L" #'evil-find-char-to-backward)
        (evil-global-set-noninsert-key "r" #'evil-search-next)
        (evil-global-set-noninsert-key "k" #'evil-forward-word-end)
        (evil-global-set-noninsert-key "K" #'evil-forward-WORD-end)

        (evil-global-set-noninsert-key (kbd "M-a") 'evil-beginning-of-line)
        (evil-global-set-noninsert-key (kbd "M-o") 'evil-end-of-line)

        (evil-global-set-key 'insert (kbd "C-t") 'transpose-chars)
        (evil-global-set-key 'visual (kbd "u") #'undo-tree-undo)
        (evil-global-set-key 'motion (kbd "SPC") #'evil-ace-jump-word-mode)

        ;; colemak window motion
        (define-key 'evil-window-map (kbd "n") #'evil-window-right)
        (define-key 'evil-window-map (kbd "e") #'evil-window-left)
        (define-key 'evil-window-map (kbd "s") #'evil-window-up)
        (define-key 'evil-window-map (kbd "t") #'evil-window-down)

        ;; additional extended commands
        (evil-ex-define-cmd "k[ill]" #'kill-this-buffer)
        (evil-ex-define-cmd "t[angle]" #'org-babel-tangle))
    #+END_SRC

    #+RESULTS:
    : -1

